In [1]:
import pandas as pd

In [2]:
data = {
    'a': [1,2,3,4],
    'b': [4,5,6,7],
    'c': ["Aryan", "Hitesh", "Piyush", "Krish"],
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   a  b       c
0  1  4   Aryan
1  2  5  Hitesh
2  3  6  Piyush
3  4  7   Krish

In [5]:
df.set_index('a', inplace=True)

In [6]:
df

   b       c
a
1  4   Aryan
2  5  Hitesh
3  6  Piyush
4  7   Krish

In [7]:
df.reset_index(inplace=True)

In [8]:
df

   a  b       c
0  1  4   Aryan
1  2  5  Hitesh
2  3  6  Piyush
3  4  7   Krish

In [9]:
df.reindex([2,3,1,0])

   a  b       c
2  3  6  Piyush
3  4  7   Krish
1  2  5  Hitesh
0  1  4   Aryan

In [10]:
for i,j in df.iterrows():
    print(i)
    print(j)

0
a        1
b        4
c    Aryan
Name: 0, dtype: object
1
a         2
b         5
c    Hitesh
Name: 1, dtype: object
2
a         3
b         6
c    Piyush
Name: 2, dtype: object
3
a        4
b        7
c    Krish
Name: 3, dtype: object

In [11]:
for i,j,c,e in df.itertuples():
    print(i,j,c,e)

0 1 4 Aryan
1 2 5 Hitesh
2 3 6 Piyush
3 4 7 Krish

In [12]:
[i for i in df['a']]

[1, 2, 3, 4]

In [13]:
list(df['a'])

[1, 2, 3, 4]

In [14]:
def test(s):
    return s.sum()

df.apply(test)

a                        10
b                        22
c    AryanHiteshPiyushKrish
dtype: object

In [17]:
df2 =df[['a','b']]

In [18]:
df2

   a  b
0  1  4
1  2  5
2  3  6
3  4  7

In [21]:
df2.applymap(lambda x: x**2)

C:\Users\USER\AppData\Local\Temp\ipykernel_29100\1663923371.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df2.applymap(lambda x: x**2)

    a   b
0   1  16
1   4  25
2   9  36
3  16  49

In [23]:
df2.map(lambda x: x**2)

    a   b
0   1  16
1   4  25
2   9  36
3  16  49

In [24]:
df

   a  b       c
0  1  4   Aryan
1  2  5  Hitesh
2  3  6  Piyush
3  4  7   Krish

In [29]:
df.sort_values('c', ascending=False)

   a  b       c
2  3  6  Piyush
3  4  7   Krish
1  2  5  Hitesh
0  1  4   Aryan

In [30]:
df.sort_index( ascending=False)

   a  b       c
3  4  7   Krish
2  3  6  Piyush
1  2  5  Hitesh
0  1  4   Aryan

In [40]:
pd.set_option('display.max_colwidth', 1000)

df3 = pd.DataFrame({'desc': ['Lorem ipsum dolor sit amet consectetur adipisicing elit. Assumenda expedita voluptatum asperiores aliquam itaque totam eaque distinctio eius commodi quam nostrum illum placeat, ducimus earum consectetur harum doloremque. Dolore quae esse harum voluptates magni quo sapiente atque mollitia, voluptatem dolores. Ipsum voluptatum voluptates amet veritatis, consectetur illum assumenda quisquam quas nesciunt, dolorum harum tempore accusamus sequi modi sint nobis similique natus iusto. Dignissimos asperiores recusandae, a quo maiores ea ad.']})

In [41]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         desc
0  Lorem ipsum dolor sit amet consectetur adipisicing elit. Assumenda expedita voluptatum asperiores aliquam itaque totam eaque distinctio eius commodi quam nostrum illum placeat, ducimus earum consectetur harum doloremque. Dolore quae esse harum voluptates magni quo sapiente atque mollitia, voluptatem dolores. Ipsum voluptatum voluptates amet veritatis, consectetur illum assumenda quisquam quas nesciunt, dolorum harum tempore accusamus sequi modi sint nobis similique natus iusto. Dignissimos asperiores recusandae, a quo maiores ea ad.

In [43]:
df3["word_count"] = df3['desc'].apply(lambda x:len(x.split()))

In [44]:
df3

,desc,word_count
0,"Lorem ipsum dolor sit amet consectetur adipisicing elit. Assumenda expedita voluptatum asperiores aliquam itaque totam eaque distinctio eius commodi quam nostrum illum placeat, ducimus earum consectetur harum doloremque. Dolore quae esse harum voluptates magni quo sapiente atque mollitia, voluptatem dolores. Ipsum voluptatum voluptates amet veritatis, consectetur illum assumenda quisquam quas nesciunt, dolorum harum tempore accusamus sequi modi sint nobis similique natus iusto. Dignissimos asperiores recusandae, a quo maiores ea ad.",70

In [45]:
df

   a  b       c
0  1  4   Aryan
1  2  5  Hitesh
2  3  6  Piyush
3  4  7   Krish

In [46]:
df['a']

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [47]:
df['a'].mean()

2.5

In [48]:
df['a'].median()

2.5

In [49]:
df['a'].std()

1.2909944487358056

In [51]:
df['a'].mode()

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [52]:
df['a'].min()

1

In [55]:
df['a'].corr

<bound method Series.corr of 0    1
1    2
2    3
3    4
Name: a, dtype: int64>

In [56]:
df['a'].max()

4

In [59]:
df4 = pd.DataFrame({'a': [2,3,4,5,7,9,4,5,1,3,]})

In [60]:
df4

   a
0  2
1  3
2  4
3  5
4  7
5  9
6  4
7  5
8  1
9  3

In [61]:
df4['a']

0    2
1    3
2    4
3    5
4    7
5    9
6    4
7    5
8    1
9    3
Name: a, dtype: int64

In [67]:
df4['a'].rolling(window=1).mean()

0    2.0
1    3.0
2    4.0
3    5.0
4    7.0
5    9.0
6    4.0
7    5.0
8    1.0
9    3.0
Name: a, dtype: float64

In [68]:
df4['a'].rolling(window=2).mean()

0    NaN
1    2.5
2    3.5
3    4.5
4    6.0
5    8.0
6    6.5
7    4.5
8    3.0
9    2.0
Name: a, dtype: float64

In [69]:
df4['a'].rolling(window=3).mean()

0         NaN
1         NaN
2    3.000000
3    4.000000
4    5.333333
5    7.000000
6    6.666667
7    6.000000
8    3.333333
9    3.000000
Name: a, dtype: float64